// это конечно прикольно но в ту же очередь это же ужасно

/*
работа с тегами-безгранично минимальна ( корректно конечно и все правильно но... )
модуль очень условно
конструктор при реализации отсутствует

понимаешь ли ты что при каждом изменении парраметра src у тега браузер
отправляет запрос на сервер на получение указанной картинки ?

соответственно с медленным интернетом будет много возможностей понаблюдать default-ный прелоад тега img и почитать его альт браузера ))

это можно все решить с помощью логичного использования прокси или браузерного кеша но я вам об этом не рассказывал

за идею и реализацию пять

за дз двойка 

Минимализм в коде это хороше еще лучше когда при минимуме кода он читаем и понятен ( с этой стороны все хороше )

но повторное использования данного образчика почти невозможно анимация отсутствует
организация галереи недееспособна в таком виде (на сервер галерею заливать нельзя)

*/