// вау
/*
просто вау
ничего лишнего все организовано
читаемо (именованиепеременных гуд)
tel - логичнее phone
obj - логичнее tag 
	но это сущий пустяк

ркгулярки конечно хромают или пониманиезадчи это мнетак сразу не видно.
обычно русский язык дополнительный так чтоизначально формируються проверки изходя из английского алфавита
но в принципе итакая задача может быть;

при описании регулярок старайсяиспользовать зарезервированные множества (и код короче и читать лечге)
тут табличка не плохая http://www.softtime.ru/info/articlephp.php?id_article=42


это не упрек просто сравни что бы понять
	var namePattern = /^[А-Я]{1}[а-яё]+/, 		=> /^[А-Я,A-Z]{1}[^\d\s]{2,}$/.test('Фqqqqqq') - первая большая остальные не пробелы и не цифры 
		lastNamePattern = /^[А-Я]{1}[а-яё]+/,	=>	и сюда такая тоже подходит )
		emailPattern = /[a-z0-9]+[.\-_]?[a-z0-9]+?@[a-z]+\.[a-z]{2,5}/i, 	=> /^\w{2,}@{1}[^\d\s]{2,}[\.]{1}[^\d\s]{2,}$/ - дофига писать попробуй сам разобрать
		telPattern =  /\+\d[-(]?\d{3}[)]?[-]?\d{3}[-]?\d{2}[-]?\d{2}$/,
		passPattern = /([a-zA-Z0-9]+){8,30}$/;
		// разные простенькие варианты пароля
		/[\d]+?.{6,20}/.test('2_qweqwe'); - обязательная цифра минимум 6 символов
		/([\d]+?|[\w]+?).{6,20}/.test('qweqw_e2'); - безтолковый вариант так как в множество \w входит множество \d =))
		/[\w]+?.{6,20}/.test('2_qweqwe'); - обязательная цифра или спецсимвол (_) , минимум 6 символов
		/[\d\D]+?.{6,20}/.test('qweqwe');- обязательная цифра и не цифра, минимум 6 символов
*/
