/*
-=@---------  feedback -------------@=-

	нравиться оформление кода
	правда я не понял с какой целью ты использовал конструктор))
	так же с опытом еще прийдет но постарайся пожалуйстаименовать переменные (метода и обьекты тоже) логично
	другими словами что быбыло по именипеременной понятно какое значение она в себе несет.

	так же в твоем варианте событие срабатывает  дважды ( 'focusout' и 'blur' ) во всех браузерах кроме ff
	(советую обратить внимание на полиморфы если интересен такой подход) правильно будет использовать
	либо одно событие либо определять когда какое использовать
	в данном случае визульно это не заметно "НО" это ошибка
	непонимание которойможет стоить нескольких часов фиксов и ковыряний в "5 строчках кода" =))

	1) валидация имени - неплохо бы было включить не только английский алфавит ( хотя такое ТЗ очень дажеможет быть )

	2) +

	3) использование скобок в данном случаенеоправданно без них будет работать так же (в общем перемудрил) =)

	4) ты уверен что при вводе номера телефонанужны скобки вокруг индексаоператора ?
		такое конечно можно встретить но тогда образца телефона плейсхолдеромможет быть недостаточно
		так как когдапользователь начинает писать ему уже негдеподсмотреть "чегоот него хотят"

	5) не обижайся но это => {6,63}$  единственная верная часть проверки пароля пароля =)
		ожидал от тебя большего

		/[\d]+?.{6,20}/.test('2_qweqwe'); - обязательная цифра минимум 6 символов
		/([\d]+?|[\w]+?).{6,20}/.test('qweqw_e2'); - безтолковый вариант так как в множество \w входит множество \d =))
		/[\w]+?.{6,20}/.test('2_qweqwe'); - обязательная цифра или спецсимвол (_) , минимум 6 символов
		/[\d\D]+?.{6,20}/.test('qweqwe');- обязательная цифра и не цифра, минимум 6 символов

		кому не лень пустьсюда подсматривают =))

	Это может помоч http://www.softtime.ru/info/articlephp.php?id_article=42
*/